docs/notes/windows.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows Stuff</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Windows Stuff</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf8922b">Environment Variables</a>
<ul>
<li><a href="#org2db55ef">List all env vars</a></li>
<li><a href="#org535323a">Function to update env variable</a></li>
<li><a href="#org553852c">setx</a></li>
</ul>
</li>
<li><a href="#org85be127">Background Process</a>
<ul>
<li><a href="#orgd0b4980">Start-Process</a></li>
<li><a href="#orgd3c2240">Start-Job</a></li>
<li><a href="#org5b3e365">Scheduled Task</a></li>
<li><a href="#org0045f40">Subshell with -NoExit</a></li>
</ul>
</li>
<li><a href="#org1767627">Kill a Process</a></li>
<li><a href="#orgb3d1b98">Install Python</a></li>
<li><a href="#org8465bd6">Upgrade Powershell</a></li>
</ul>
</div>
</nav>
<p>
I don't have a Windows machine so I don't test these notes, ever. Some of what I
wrote here doesn't look like it makes much sens. But I guess if I wrote it down,
it must have been useful at the time!
</p>

<div id="outline-container-orgbf8922b" class="outline-2">
<h2 id="orgbf8922b"><a href="#orgbf8922b">Environment Variables</a></h2>
<div class="outline-text-2" id="text-orgbf8922b">
</div>
<div id="outline-container-org2db55ef" class="outline-3">
<h3 id="org2db55ef"><a href="#org2db55ef">List all env vars</a></h3>
<div class="outline-text-3" id="text-org2db55ef">
<div class="org-src-container">
<pre class="src src-powershell">gci env: | sort name
</pre>
</div>
</div>
</div>

<div id="outline-container-org535323a" class="outline-3">
<h3 id="org535323a"><a href="#org535323a">Function to update env variable</a></h3>
<div class="outline-text-3" id="text-org535323a">
<p>
This is an attempt at a function to update environment variables permanently.
It correctly sets a registry key, but it only takes effect after a reboot.
</p>

<div class="org-src-container">
<pre class="src src-powershell">Function global:Add-Path()
{
    Param (
        [String]$NewDir
    )

    $RegKey = 'Registry::HKEY_LOCAL_MACHINE\System\CurrentControlSet\Control\Session Manager\Environment'
    $OldPath=(Get-ItemProperty -Path "$RegKey" -Name PATH).Path
    $NewPath = $OldPath + ';' + $NewDir
    Set-ItemProperty -Path "$RegKey" -Name PATH –Value $NewPath
    Return $NewPath
}
</pre>
</div>

<p>
It's potentially possible to use <code>SendMessage</code> to update the environment for
currently-running processes. It would look something like:
</p>

<div class="org-src-container">
<pre class="src src-powershell">SendMessage (HWND_BROADCAST, WM_SETTINGCHANGE, 0, (LPARAM)"Environment")
</pre>
</div>

<p>
There is another registry key <code>HKEY_CURRENT_USER\Environment</code> that can also be
used.
</p>
</div>
</div>

<div id="outline-container-org553852c" class="outline-3">
<h3 id="org553852c"><a href="#org553852c">setx</a></h3>
<div class="outline-text-3" id="text-org553852c">
<p>
<code>setx</code> can set an environment variable and persist it, but it will only be
available to new processes.
</p>

<div class="org-src-container">
<pre class="src src-sh">setx /m FOO bar
</pre>
</div>

<p>
If you need the env var in the sshd environment, restart sshd:
</p>

<div class="org-src-container">
<pre class="src src-powershell">Stop-Service sshd
Start-Service sshd
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org85be127" class="outline-2">
<h2 id="org85be127"><a href="#org85be127">Background Process</a></h2>
<div class="outline-text-2" id="text-org85be127">
</div>
<div id="outline-container-orgd0b4980" class="outline-3">
<h3 id="orgd0b4980"><a href="#orgd0b4980">Start-Process</a></h3>
<div class="outline-text-3" id="text-orgd0b4980">
<div class="org-src-container">
<pre class="src src-powershell">Start-Process `
  -FilePath go.exe `
  -NoNewWindow `
  -ArgumentList ('run', 'cli/tools/server/cmd/server.go') `
  -PassThru
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3c2240" class="outline-3">
<h3 id="orgd3c2240"><a href="#orgd3c2240">Start-Job</a></h3>
</div>

<div id="outline-container-org5b3e365" class="outline-3">
<h3 id="org5b3e365"><a href="#org5b3e365">Scheduled Task</a></h3>
</div>

<div id="outline-container-org0045f40" class="outline-3">
<h3 id="org0045f40"><a href="#org0045f40">Subshell with -NoExit</a></h3>
</div>
</div>

<div id="outline-container-org1767627" class="outline-2">
<h2 id="org1767627"><a href="#org1767627">Kill a Process</a></h2>
</div>

<div id="outline-container-orgb3d1b98" class="outline-2">
<h2 id="orgb3d1b98"><a href="#orgb3d1b98">Install Python</a></h2>
<div class="outline-text-2" id="text-orgb3d1b98">
<div class="org-src-container">
<pre class="src src-powershell">$url = https://www.python.org/ftp/python/3.6.3/python-3.6.3-amd64.exe
Invoke-WebRequest -Uri $url -OutFile pythoninstaller.exe

./pythoninstaller.exe /quiet `
  InstallAllUsers=1 `
  PrependPath=1 `
  Include_test=0 `
  Include_doc=0 `
  Include_tcltk=0
</pre>
</div>
</div>
</div>

<div id="outline-container-org8465bd6" class="outline-2">
<h2 id="org8465bd6"><a href="#org8465bd6">Upgrade Powershell</a></h2>
<div class="outline-text-2" id="text-org8465bd6">
<div class="org-src-container">
<pre class="src src-powershell">$scriptUri = https://raw.githubusercontent.com/jborean93/ansible-windows/master/scripts/Upgrade-PowerShell.ps1
Invoke-WebRequest -Uri $scriptUri
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
